Конфигурация/Catalogs/НастройкиРасчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>НастройкиРасчета</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыРасчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Составляющие</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Периодичность</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ПериодичностьРасчетаВознагражденияУправляющего</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БазаРасчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БазыРасчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПараметрыРасчета</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация/Enums/ВидыРасчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыРасчета</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>РасчетДоходности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетВознагражденияУправляющего</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетПроцентнойСтавки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетРезервовПИФ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетНадбавокИСкидокПаевыхИнвестиционныхФондов</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Catalogs/НастройкиРасчета/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область События_формы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	Если УниверсальныеМеханизмы.ФормаСоздана(ЭтаФорма) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не УниверсальныеМеханизмы.ПриСозданииФормыНаСервере(ЭтаФорма,,, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	ПриЧтенииСозданииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Для Каждого СтрокаСоставляющие Из Объект.Составляющие Цикл
		ТекущийОбъект.Составляющие[СтрокаСоставляющие.НомерСтроки - 1].ПараметрыРасчета = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(СтрокаСоставляющие.АдресВременногоХранилища), Новый СжатиеДанных(9));
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаполнитьАдресаВременногоХранилищаПараметров();
	
КонецПроцедуры

#КонецОбласти

#Область События_элементов_формы

&НаКлиенте
Процедура СоставляющиеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;	
	
	ИзменитьСоставляющую(Элемент, Ложь, Ложь);	
	
КонецПроцедуры

&НаКлиенте
Процедура СоставляющиеПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Не ЗначениеЗаполнено(Объект.ВидРасчета) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Поле ""Вид расчета"" не заполнено!",,, "Объект.ВидРасчета", Отказ);
	КонецЕсли;
	
	Если Объект.ВидРасчета = ПредопределенноеЗначение("Перечисление.ВидыРасчета.РасчетДоходности") Тогда
		
		// Ключевая ставка и фиксированная ставка могут быть либо одни, либо вдвоем
		
		Если Объект.Составляющие.НайтиСтроки(Новый Структура("БазаРасчета", ПредопределенноеЗначение("Справочник.БазыРасчета.КлючеваяСтавкаЦБРФ"))).Количество() > 0
			ИЛИ Объект.Составляющие.НайтиСтроки(Новый Структура("БазаРасчета", ПредопределенноеЗначение("Справочник.БазыРасчета.ФиксированнаяСтавка"))).Количество() > 0
		Тогда
		
			Если Объект.Составляющие.Количество() = 2 Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Настройка расчета может состоять только из одной базы расчета ""Фиксированная ставка"" и ""Ключевая ставка ЦБ РФ"", либо из их объединения!", , , , Отказ);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не Отказ Тогда
		ИзменитьСоставляющую(Элемент, Истина, Копирование);	
	КонецЕсли;
	
	Отказ = Истина; // Добавляем строку только через свою функцию
	
КонецПроцедуры

&НаКлиенте
Процедура СоставляющиеПриИзменении(Элемент)
	
	РаботаСНормативноСправочнойИнформациейКлиент.УстановитьНовоеНаименование(Объект);	
	
КонецПроцедуры

&НаКлиенте
Процедура ВидРасчетаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

	Если Объект.ВидРасчета <> ВыбранноеЗначение
		И Объект.Составляющие.Количество() > 0 	
	Тогда
	
		РезультатВопроса = Вопрос("Список составляющих будет очищен. Продолжить?", РежимДиалогаВопрос.ОКОтмена, , КодВозвратаДиалога.ОК);
		Если РезультатВопроса = КодВозвратаДиалога.ОК Тогда
			Объект.Составляющие.Очистить();	
		Иначе
			СтандартнаяОбработка = Ложь;
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидРасчетаПриИзменении(Элемент)
	
	НастроитьВидимостьДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ВалютаРасчетаПриИзменении(Элемент)
	
	РаботаСНормативноСправочнойИнформациейКлиент.УстановитьНовоеНаименование(Объект);	
	
КонецПроцедуры

#КонецОбласти

#Область Служебные_процедуры_и_функции

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()

	ЗаполнитьАдресаВременногоХранилищаПараметров();	
	
	УниверсальныеМеханизмы.УстановитьЗаголовокФормы(ЭтаФорма);	
	
	НастроитьВидимостьДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьВидимостьДоступность(Форма)

	Элементы = Форма.Элементы;
	Объект   = Форма.Объект;
	
	ЭтоРасчетВознаграждения = Объект.ВидРасчета = ПредопределенноеЗначение("Перечисление.ВидыРасчета.РасчетВознагражденияУправляющего");
	
	Элементы.ВалютаРасчета.Видимость			 = ЭтоРасчетВознаграждения;
	Элементы.СоставляющиеПериодичность.Видимость = ЭтоРасчетВознаграждения;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьАдресаВременногоХранилищаПараметров()
	
	Если Параметры.Свойство("ЗначениеКопирования") И ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		РеквизитОбъект = Параметры.ЗначениеКопирования.ПолучитьОбъект();
	Иначе
		РеквизитОбъект = РеквизитФормыВЗначение("Объект");
	КонецЕсли;	
	
	Для Каждого СтрокаСоставляющие Из Объект.Составляющие Цикл
		СтрокаСоставляющие.АдресВременногоХранилища = ПоместитьВоВременноеХранилище(РеквизитОбъект.Составляющие[СтрокаСоставляющие.НомерСтроки - 1].ПараметрыРасчета.Получить(), ЭтаФорма.УникальныйИдентификатор);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСоставляющую(Элемент, НоваяСтрока, Копирование)
	
	// Определяем редактируем ли мы текущую строку или добавляем новую
	
	Если НоваяСтрока Тогда
		
		ТекущаяСтрока = Объект.Составляющие.Добавить();
		
		Если Копирование Тогда
			ЗаполнитьЗначенияСвойств(ТекущаяСтрока, Элемент.ТекущиеДанные, , "НомерСтроки, АдресВременногоХранилища");	
		КонецЕсли;
		
		Если Копирование И ЭтоАдресВременногоХранилища(Элемент.ТекущиеДанные.АдресВременногоХранилища) Тогда
			ТекущаяСтрока.АдресВременногоХранилища = ПоместитьВоВременноеХранилище(ПолучитьИзВременногоХранилища(Элемент.ТекущиеДанные.АдресВременногоХранилища), ЭтаФорма.УникальныйИдентификатор);
		Иначе
			ТекущаяСтрока.АдресВременногоХранилища = ПоместитьВоВременноеХранилище(Новый Структура, ЭтаФорма.УникальныйИдентификатор);
		КонецЕсли;
		
		Элемент.ТекущаяСтрока = ТекущаяСтрока.ПолучитьИдентификатор();
		
	Иначе
		
		ТекущаяСтрока = Объект.Составляющие.НайтиПоИдентификатору(Элемент.ТекущаяСтрока);	
		
	КонецЕсли;
	
	// Передаем структуру строки в форму редактирования параметров расчета	
	
	Составляющая = Новый Структура("ВидРасчета, ВалютаРасчета, БазаРасчета, Периодичность, Представление, АдресВременногоХранилища", Объект.ВидРасчета, Объект.ВалютаРасчета);	
	
	ЗаполнитьЗначенияСвойств(Составляющая, ТекущаяСтрока);
	
	ПараметрыФормы = Новый Структура("Составляющая", Составляющая);
	
	Результат = ОткрытьФормуМодально("Справочник.НастройкиРасчета.Форма.ПараметрыРасчета", ПараметрыФормы);
	
	Если Результат <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ТекущаяСтрока, Результат);
		РаботаСНормативноСправочнойИнформациейКлиент.УстановитьНовоеНаименование(Объект);	
	ИначеЕсли НоваяСтрока Тогда
		Объект.Составляющие.Удалить(ТекущаяСтрока);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
